#+title:A genome-wide perspective on the peopling of the British Isles
#+author:Dan, Chris, Garrett, Peter et al.


* Data
PoBI + MS cases (Illumina)

|         | HGDP | MS cases | MS controls | PoBI       | Etc                              |
|---------+------+----------+-------------+------------+----------------------------------|
| UK      |      |     2048 |             | 2912 - 368 |                                  |
| Ireland |      |       73 |             |            |                                  |
| Iberia  |      |      211 |             |            |                                  |
| France  |      |      536 |         357 |            |                                  |
| Germany |      |     1166 |     468+784 |            |                                  |
| Norway  |      |     1030 |         125 |            | Pillai et al. PLoS Genetics 2009 |

#+begin_src sh :var ms="~/Work/Papers/PoBI/MS_illumina.sample.geoinfoIII"
 sed 1d $ms | cut -d' ' -f3 | ~/bin/table
#+end_src

#+results:
| Australia  |  705 |
| Belgium    |  566 |
| Denmark    |  363 |
| FIN        |  652 |
| France     |  536 |
| Germany    | 1166 |
| Ireland    |   73 |
| Italy      |  776 |
| NewZealand |  156 |
| Norway     | 1030 |
| Poland     |   59 |
| Spain      |  211 |
| Sweden     | 1401 |
| UK         | 2048 |
| USA        | 1634 |

#+begin_src R :var ms="~/Work/Papers/PoBI/MS_illumina.sample.geoinfoIII" :session :rownames yes
  n <- table(scan(pipe(sprintf("sed 1d %s | cut -d' ' -f3", ms)), what=""))
  bad <- c("FIN","USA","NewZealand","Australia")
  n <- indivs[!names(n) %in% bad]
  n
#+end_src

#+tblname:ms-pobi
| Norway    | 1030 |
| Sweden    | 1401 |
| Denmark   |  363 |
| Germany   | 1166 |
| Poland    |   59 |
| Belgium   |  566 |
| France    |  536 |
| Italy     |  776 |
| Spain     |  211 |
| Ireland   |   73 |
| UK        | 2048 |
| UK - PoBI | 2912 |

#+begin_src R :var mspobi=ms-pobi :rownames yes
  sum(mspobi)
#+end_src

#+results:
| 1 | 11141 |
*** POPRES
	[[file:~/lit/novembre-etal-2008-popres-europe.pdf][paper.pdf]]
#+begin_src sh :dir /davison@oak.well.ox.ac.uk:data/popres
  sed 1d genome-res/GSK_sample_info.tsv | cut -f4 | table | sort -nr -k2
#+end_src

#+results:
| Switzerland        | 1325 |
| United             |  424 |
| Kingdom            |  424 |
| Italy              |  213 |
| France             |  205 |
| India              |  199 |
| Spain              |  137 |
| Portugal           |  133 |
| Canada             |  133 |
| Mexico             |  112 |
| Taiwan             |  108 |
| Germany            |   88 |
| Australia          |   78 |
| Japan              |   73 |
| Ireland            |   61 |
| Yugoslavia         |   47 |
| Pakistan           |   45 |
| USA                |   44 |
| Belgium            |   43 |
| Africa             |   35 |
| East               |   30 |
| Kenya              |   29 |
| Poland             |   26 |
| Netherlands        |   21 |
| Hungary            |   20 |
| Sri                |   18 |
| Lanka              |   18 |
| Romania            |   16 |
| Austria            |   16 |
| Sweden             |   15 |
| Republic           |   14 |
| Czech              |   14 |
| Unknown            |   13 |
| Greece             |    9 |
| Croatia            |    9 |
| Bosnia-Herzegovina |    9 |
| Russia             |    8 |
| Turkey             |    7 |
| Argentina          |    7 |
| Scotland           |    6 |
| Egypt              |    6 |
| Algeria            |    6 |
| Uganda             |    5 |
| Morocco            |    5 |
| Congo              |    5 |
| Angola             |    5 |
| South              |    4 |
| Macedonia          |    4 |
| Cyprus             |    4 |
| Tunisia            |    3 |
| Singapore          |    3 |
| Israel             |    3 |
| Albania            |    3 |
| Afghanistan        |    3 |
| Zimbabwe           |    2 |
| Zealand            |    2 |
| Ukraine            |    2 |
| Norway             |    2 |
| New                |    2 |
| Mozambique         |    2 |
| Lebanon            |    2 |
| Iran               |    2 |
| Finland            |    2 |
| China              |    2 |
| Bulgaria           |    2 |
| America            |    2 |
| Venezuela          |    1 |
| USSR               |    1 |
| Tanzania           |    1 |
| Slovenia           |    1 |
| Slovakia           |    1 |
| Serbia             |    1 |
| Senegal            |    1 |
| Peru               |    1 |
| North              |    1 |
| Malta              |    1 |
| Luxembourg         |    1 |
| Latvia             |    1 |
| Kosovo             |    1 |
| Ivory              |    1 |
| Iraq               |    1 |
| Grenada            |    1 |
| Gibraltar          |    1 |
| Europe             |    1 |
| Denmark            |    1 |
| Coast              |    1 |
| Cameroon           |    1 |
| Burundi            |    1 |
| Burma              |    1 |
| Bangladesh         |    1 |
	
